//Задача 1. Задайте массив. Напишите программу, которая определяет, присутствует ли
// заданное число в массиве. Программа должна выдать ответ: Да/Нет.
// Примеры
// [1 3 4 19 3], 8 => Нет
// [-4 3 4 1], 3 => Да

// int[] array = new int[10]; // создали массив с пятью элементами, но он пустой или пять 0

// Console.WriteLine("Введите число");
// int num = Convert.ToInt32(Console.ReadLine());

// string isFind = "Нет";

// for (int i = 0; i < array.Length; i++) // i задается 1 раз, цикл будет работать, пока выполняется 
// // второе условие, и третье действие i++ будет выполняться до тех пор, пока второе условие работает
// {
//     array[i] = new Random().Next(-5, 20); // с помощью рандома заплняем массив
//     Console.Write(array[i] + " "); // выводим массив на печать
//     // полученный пример -4 19 15 16 17 -1 10 0 7 2
//     if (array[i] == num)
//     {
//         isFind = "Да";
//     }
// }
// System.Console.WriteLine(isFind);







