// Задайте массив из 10 элементов, заполненный числами из промежутка
// [-10, 10]. Замените отрицательные элементы на положительные и наоборот
// Пример [1 -5 6] => [-1 5 -6]


// int[] array = new int[10];

// for (int i = 0; i < array.Length; i++)
// {
//     array[i] = new Random().Next(-10, 11); // крайнее значение да 1 больше т к оно не включается
//     Console.Write(array[i] + "\t");
// }

// System.Console.WriteLine();
// for (int i = 0; i < array.Length; i++)
// {
//     array[i] = -1 * array[i];
//     Console.Write(array[i] + "\t"); // "\t" для табуляции списков
// }
